app/controllers/comments_controller.rb

  def show
    @comment = @post.comments.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.post_id = 1))

  def create
      @comment = @post.comments.build(params[:comment])
      if @comment.save
---
INSERT INTO `comments` (`updated_at`, `commenter`, `post_id`, `body`, `created_at`) VALUES('2019-05-09 10:05:18', 'Janani', 1, 'Hi Tharshiiiiii', '2019-05-09 10:05:18')

  def edit
    @comment = @post.comments.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.post_id = 1))

  def update
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)

  def find_pos
      @post = Post.find(params[:post_id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)