app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `content`, `title`, `updated_at`, `name`) VALUES('2019-05-09 07:16:26', 'David Copperfield, Dickens’s eighth novel, was first published as a serial. ', 'David Copperfield', '2019-05-09 07:16:26', 'Charles Dickens')

  def update

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
UPDATE `posts` SET `updated_at` = '2019-05-09 07:17:01', `content` = 'Icarus Falls is a sophomore album of the British Singer Zayn Malik.' WHERE `id` = 3

  def destroy

    @post.destroy
---
DELETE FROM `posts` WHERE `id` = 7

  def preview
    posts = Post.all
---
SELECT * FROM `posts`

  def find_post
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 7)